20210930153026-um_sjtu_t5.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>UM-SJTU-T5</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content">
<h1 class="title">UM-SJTU-T5</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgc9b091a">Prerequisite <code>[0/5]</code></a>
<ul>
<li><a href="#org45c0ef3">[ ] Server</a></li>
<li><a href="#orgf0ce863">[ ] laptop</a></li>
<li><a href="#org8067d5b">[ ] Company Account</a></li>
<li><a href="#org1485223">[ ] Company Seat</a></li>
<li><a href="#org7f3fb2f">[ ] Gitlab and Jira</a></li>
</ul>
</li>
<li><a href="#org38ffaf5">Seminar</a>
<ul>
<li><a href="#org9555835">PG/PCG</a>
<ul>
<li><a href="#orgd492f25">Increasing generality in machine learning through procedural content generation</a></li>
</ul>
</li>
<li><a href="#org6745add">PGDrive</a>
<ul>
<li><a href="#org5e7b756">mproving the Generalization of End-to-End Driving through Procedural Generation</a></li>
</ul>
</li>
<li><a href="#orgcf7fc9b">DRL</a></li>
</ul>
</li>
<li><a href="#org07dadb0">Jira</a>
<ul>
<li><a href="#orgcaff6ad">Sprint Prep</a>
<ul>
<li><a href="#orgd4fb158">owner, master, milestone, epic, story</a></li>
<li><a href="#orga1dc447">meeting set</a></li>
<li><a href="#org77e7a23">repo setting rules</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga0ad98f">Extentions</a>
<ul>
<li><a href="#orgc6756a7">guided domain randomization</a>
<ul>
<li><a href="#org61e0b50">entropy</a></li>
<li><a href="#org0027116">reward</a></li>
<li><a href="#orgb1b8524">design</a></li>
</ul>
</li>
<li><a href="#orga7a0814">automatic domain randomization</a>
<ul>
<li><a href="#orgaced121">exploration</a></li>
<li><a href="#orgeaa1836">curiosity</a></li>
<li><a href="#org47ab9a2">policy gradient</a></li>
<li><a href="#orgc4f2ab8">generalization</a></li>
</ul>
</li>
<li><a href="#org731b310">search based PCG</a>
<ul>
<li><a href="#orgf4b6baa">orthogonal (independent) PCG to the learning diversity</a></li>
</ul>
</li>
<li><a href="#orgd7926fa">PCG via ML</a>
<ul>
<li><a href="#org4f91194">functional content</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<p>
:ID:       dbd81655-b7c8-470d-b69a-292f6bfb3da5
</p>
<div id="outline-container-orgc9b091a" class="outline-2">
<h2 id="orgc9b091a">Prerequisite <code>[0/5]</code></h2>
<div class="outline-text-2" id="text-orgc9b091a">
</div>
<div id="outline-container-org45c0ef3" class="outline-3">
<h3 id="org45c0ef3">[ ] Server</h3>
</div>
<div id="outline-container-orgf0ce863" class="outline-3">
<h3 id="orgf0ce863">[ ] laptop</h3>
</div>
<div id="outline-container-org8067d5b" class="outline-3">
<h3 id="org8067d5b">[ ] Company Account</h3>
</div>
<div id="outline-container-org1485223" class="outline-3">
<h3 id="org1485223">[ ] Company Seat</h3>
</div>
<div id="outline-container-org7f3fb2f" class="outline-3">
<h3 id="org7f3fb2f">[ ] Gitlab and Jira</h3>
</div>
</div>

<div id="outline-container-org38ffaf5" class="outline-2">
<h2 id="org38ffaf5">Seminar</h2>
<div class="outline-text-2" id="text-org38ffaf5">
</div>
<div id="outline-container-org9555835" class="outline-3">
<h3 id="org9555835">PG/PCG</h3>
<div class="outline-text-3" id="text-org9555835">
</div>
<div id="outline-container-orgd492f25" class="outline-4">
<h4 id="orgd492f25">Increasing generality in machine learning through procedural content generation</h4>
</div>
</div>
<div id="outline-container-org6745add" class="outline-3">
<h3 id="org6745add">PGDrive</h3>
<div class="outline-text-3" id="text-org6745add">
</div>
<div id="outline-container-org5e7b756" class="outline-4">
<h4 id="org5e7b756">mproving the Generalization of End-to-End Driving through Procedural Generation</h4>
</div>
</div>
<div id="outline-container-orgcf7fc9b" class="outline-3">
<h3 id="orgcf7fc9b">DRL</h3>
</div>
</div>

<div id="outline-container-org07dadb0" class="outline-2">
<h2 id="org07dadb0">Jira</h2>
<div class="outline-text-2" id="text-org07dadb0">
</div>
<div id="outline-container-orgcaff6ad" class="outline-3">
<h3 id="orgcaff6ad">Sprint Prep</h3>
<div class="outline-text-3" id="text-orgcaff6ad">
</div>
<div id="outline-container-orgd4fb158" class="outline-4">
<h4 id="orgd4fb158">owner, master, milestone, epic, story</h4>
</div>
<div id="outline-container-orga1dc447" class="outline-4">
<h4 id="orga1dc447">meeting set</h4>
</div>
<div id="outline-container-org77e7a23" class="outline-4">
<h4 id="org77e7a23">repo setting rules</h4>
</div>
</div>
</div>
<div id="outline-container-orga0ad98f" class="outline-2">
<h2 id="orga0ad98f">Extentions</h2>
<div class="outline-text-2" id="text-orga0ad98f">
</div>
<div id="outline-container-orgc6756a7" class="outline-3">
<h3 id="orgc6756a7">guided domain randomization</h3>
<div class="outline-text-3" id="text-orgc6756a7">
</div>
<div id="outline-container-org61e0b50" class="outline-4">
<h4 id="org61e0b50">entropy</h4>
</div>
<div id="outline-container-org0027116" class="outline-4">
<h4 id="org0027116">reward</h4>
</div>
<div id="outline-container-orgb1b8524" class="outline-4">
<h4 id="orgb1b8524">design</h4>
</div>
</div>
<div id="outline-container-orga7a0814" class="outline-3">
<h3 id="orga7a0814">automatic domain randomization</h3>
<div class="outline-text-3" id="text-orga7a0814">
</div>
<div id="outline-container-orgaced121" class="outline-4">
<h4 id="orgaced121">exploration</h4>
</div>
<div id="outline-container-orgeaa1836" class="outline-4">
<h4 id="orgeaa1836">curiosity</h4>
</div>
<div id="outline-container-org47ab9a2" class="outline-4">
<h4 id="org47ab9a2">policy gradient</h4>
</div>
<div id="outline-container-orgc4f2ab8" class="outline-4">
<h4 id="orgc4f2ab8">generalization</h4>
</div>
</div>
<div id="outline-container-org731b310" class="outline-3">
<h3 id="org731b310">search based PCG</h3>
<div class="outline-text-3" id="text-org731b310">
</div>
<div id="outline-container-orgf4b6baa" class="outline-4">
<h4 id="orgf4b6baa">orthogonal (independent) PCG to the learning diversity</h4>
</div>
</div>
<div id="outline-container-orgd7926fa" class="outline-3">
<h3 id="orgd7926fa">PCG via ML</h3>
<div class="outline-text-3" id="text-orgd7926fa">
</div>
<div id="outline-container-org4f91194" class="outline-4">
<h4 id="org4f91194">functional content</h4>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.1 (<a href="https://orgmode.org">Org</a> mode 9.3)</p>
</div>
</body>
</html>
